from typing import Final


VACCINATION_CHOICES: Final = [
    ('1', 'нет'),
    ('2', 'грипп'),
    ('3', 'пневмококк'),
    ('4', 'грипп + пневмококк'),
]

M_MRC_CHOICES = [(value, str(value)) for value in [1, 2, 3, 4]]

DDBA_DDAHP_CHOICES: Final = [
    ('1', 'Тиотропия бромид/олодатерол'),
    ('2', 'Аклидиний/формотерол'),
    ('3', 'Вилантерол/умеклидиний'),
    ('4', 'Гликопироний/индокатерол '),
    ('5', 'нет'),
]

SALBUTAMOL_CHOICES: Final = [
    ('1', 'сальбутомол'),
    ('2', 'фенотерол'),
    ('3', 'ипратропия бромид'),
    ('4', 'ипратропия бромид/фенотерол'),
]

IGCS_DDBA_CHOICES: Final = [
    ('1', 'будесонид/формотерол'),
    ('2', 'сальметерол/флутиказон'),
    ('3', 'беклометазон/формотерол'),
    ('4', 'будесонид/формотерол'),
    ('5', 'флутиказон/вилантерол'),
]

DDAHP_CHOICES: Final = [
    ('1', 'аклидиний'),
    ('2', 'тиотропий'),
    ('3', 'гликопироний'),
]

TRIPLE_FIXED_COMBINATIONS_CHOICES: Final = [
    ('1', 'нет'),
    ('2', 'флутиказон фуроат + бромид умеклидиния + вилантерол'),
    ('3', 'мометазон/гликопирроний/индоктерол'),
    ('4', 'бекламетазон/ гликопирроний/ формотерол'),
    ('5', 'будесонид/ гликопирроний/ формотерол фумарат'),
]

DISEASES_PER_YEAR_CHOICES: Final = [
    ('1', 'контроль ХОБЛ'),
    ('2', 'ухудшение'),
    ('3', 'смерть'),
]

DISPENSARY_OBSERVATION_STATUS: Final = [
    ('1', 'Наблюдение'),
    ('2', 'Переехал'),
    ('3', 'Умер'),
]
